<a href="https://colab.research.google.com/github/preeti09011999/BankApp---Android-Application/blob/master/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['w','x','y','z']
list = [10,20,30,40]
array = np.array([10,20,30,40])
dict = {'w':10,'x':20,'y':30,'z':40}

In [3]:
pd.Series(list)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
pd.Series(list,labels)

w    10
x    20
y    30
z    40
dtype: int64

In [5]:
pd.Series(array)

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

In [7]:
sports1 = pd.Series([1,2,3,4],index = ['Cricket', 'Football','Basketball', 'Golf'])

In [8]:
sports2 = pd.Series([1,2,5,4],index = ['Cricket', 'Football','Baseball', 'Golf'])

In [9]:
sports1 + sports2

Baseball      NaN
Basketball    NaN
Cricket       2.0
Football      4.0
Golf          8.0
dtype: float64

In [10]:
matrix = np.random.randn(10,5)

In [11]:
pd.DataFrame(matrix)

          0         1         2         3         4
0  0.851100 -1.083754  1.136511  0.797334 -0.841003
1 -1.770584  0.695662 -0.479670 -0.836000  0.177477
2 -0.208711 -1.037963  0.197806 -0.859532 -0.295302
3 -1.123644  0.827014 -0.670611 -0.966687 -0.629303
4 -0.329187  0.462367  0.072301  0.217168 -0.598591
5 -0.594047 -1.112598 -0.013298 -0.049444  0.419095
6  1.216281 -1.498905  0.416352  0.898640 -1.789240
7  1.470903 -1.052643  0.038047  0.575211  2.135044
8  0.781189  0.746870  1.095627 -1.719497 -0.689932
9 -0.541974  2.608786 -0.149848  0.647683  1.762130

In [12]:
'A B C D E F G H I J'.split()

['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [13]:
dataframe = pd.DataFrame(matrix, index = 'A B C D E F G H I J'.split(), columns = 'Score1 Score2 Score3 Score4 Score5'.split())

In [15]:
dataframe['Score3']

A    1.136511
B   -0.479670
C    0.197806
D   -0.670611
E    0.072301
F   -0.013298
G    0.416352
H    0.038047
I    1.095627
J   -0.149848
Name: Score3, dtype: float64

In [16]:
# Pass a list of column names in any order necessary
dataframe[['Score2','Score1']]

     Score2    Score1
A -1.083754  0.851100
B  0.695662 -1.770584
C -1.037963 -0.208711
D  0.827014 -1.123644
E  0.462367 -0.329187
F -1.112598 -0.594047
G -1.498905  1.216281
H -1.052643  1.470903
I  0.746870  0.781189
J  2.608786 -0.541974

In [17]:
type(dataframe['Score1'])

pandas.core.series.Series

In [18]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  0.851100 -1.083754  1.136511  0.797334 -0.841003
B -1.770584  0.695662 -0.479670 -0.836000  0.177477
C -0.208711 -1.037963  0.197806 -0.859532 -0.295302
D -1.123644  0.827014 -0.670611 -0.966687 -0.629303
E -0.329187  0.462367  0.072301  0.217168 -0.598591
F -0.594047 -1.112598 -0.013298 -0.049444  0.419095
G  1.216281 -1.498905  0.416352  0.898640 -1.789240
H  1.470903 -1.052643  0.038047  0.575211  2.135044
I  0.781189  0.746870  1.095627 -1.719497 -0.689932
J -0.541974  2.608786 -0.149848  0.647683  1.762130

In [19]:
dataframe['Total'] = dataframe['Score1'] + dataframe['Score2']

In [20]:
dataframe

     Score1    Score2    Score3    Score4    Score5     Total
A  0.851100 -1.083754  1.136511  0.797334 -0.841003 -0.232653
B -1.770584  0.695662 -0.479670 -0.836000  0.177477 -1.074923
C -0.208711 -1.037963  0.197806 -0.859532 -0.295302 -1.246675
D -1.123644  0.827014 -0.670611 -0.966687 -0.629303 -0.296630
E -0.329187  0.462367  0.072301  0.217168 -0.598591  0.133180
F -0.594047 -1.112598 -0.013298 -0.049444  0.419095 -1.706645
G  1.216281 -1.498905  0.416352  0.898640 -1.789240 -0.282624
H  1.470903 -1.052643  0.038047  0.575211  2.135044  0.418261
I  0.781189  0.746870  1.095627 -1.719497 -0.689932  1.528059
J -0.541974  2.608786 -0.149848  0.647683  1.762130  2.066813

In [21]:
dataframe.drop('Total', axis = 1)

     Score1    Score2    Score3    Score4    Score5
A  0.851100 -1.083754  1.136511  0.797334 -0.841003
B -1.770584  0.695662 -0.479670 -0.836000  0.177477
C -0.208711 -1.037963  0.197806 -0.859532 -0.295302
D -1.123644  0.827014 -0.670611 -0.966687 -0.629303
E -0.329187  0.462367  0.072301  0.217168 -0.598591
F -0.594047 -1.112598 -0.013298 -0.049444  0.419095
G  1.216281 -1.498905  0.416352  0.898640 -1.789240
H  1.470903 -1.052643  0.038047  0.575211  2.135044
I  0.781189  0.746870  1.095627 -1.719497 -0.689932
J -0.541974  2.608786 -0.149848  0.647683  1.762130

In [22]:
dataframe

     Score1    Score2    Score3    Score4    Score5     Total
A  0.851100 -1.083754  1.136511  0.797334 -0.841003 -0.232653
B -1.770584  0.695662 -0.479670 -0.836000  0.177477 -1.074923
C -0.208711 -1.037963  0.197806 -0.859532 -0.295302 -1.246675
D -1.123644  0.827014 -0.670611 -0.966687 -0.629303 -0.296630
E -0.329187  0.462367  0.072301  0.217168 -0.598591  0.133180
F -0.594047 -1.112598 -0.013298 -0.049444  0.419095 -1.706645
G  1.216281 -1.498905  0.416352  0.898640 -1.789240 -0.282624
H  1.470903 -1.052643  0.038047  0.575211  2.135044  0.418261
I  0.781189  0.746870  1.095627 -1.719497 -0.689932  1.528059
J -0.541974  2.608786 -0.149848  0.647683  1.762130  2.066813

In [23]:
dataframe.drop('Total', axis = 1 , inplace = True)

In [24]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  0.851100 -1.083754  1.136511  0.797334 -0.841003
B -1.770584  0.695662 -0.479670 -0.836000  0.177477
C -0.208711 -1.037963  0.197806 -0.859532 -0.295302
D -1.123644  0.827014 -0.670611 -0.966687 -0.629303
E -0.329187  0.462367  0.072301  0.217168 -0.598591
F -0.594047 -1.112598 -0.013298 -0.049444  0.419095
G  1.216281 -1.498905  0.416352  0.898640 -1.789240
H  1.470903 -1.052643  0.038047  0.575211  2.135044
I  0.781189  0.746870  1.095627 -1.719497 -0.689932
J -0.541974  2.608786 -0.149848  0.647683  1.762130

In [25]:
dataframe.drop('A', axis= 0)

     Score1    Score2    Score3    Score4    Score5
B -1.770584  0.695662 -0.479670 -0.836000  0.177477
C -0.208711 -1.037963  0.197806 -0.859532 -0.295302
D -1.123644  0.827014 -0.670611 -0.966687 -0.629303
E -0.329187  0.462367  0.072301  0.217168 -0.598591
F -0.594047 -1.112598 -0.013298 -0.049444  0.419095
G  1.216281 -1.498905  0.416352  0.898640 -1.789240
H  1.470903 -1.052643  0.038047  0.575211  2.135044
I  0.781189  0.746870  1.095627 -1.719497 -0.689932
J -0.541974  2.608786 -0.149848  0.647683  1.762130

In [26]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  0.851100 -1.083754  1.136511  0.797334 -0.841003
B -1.770584  0.695662 -0.479670 -0.836000  0.177477
C -0.208711 -1.037963  0.197806 -0.859532 -0.295302
D -1.123644  0.827014 -0.670611 -0.966687 -0.629303
E -0.329187  0.462367  0.072301  0.217168 -0.598591
F -0.594047 -1.112598 -0.013298 -0.049444  0.419095
G  1.216281 -1.498905  0.416352  0.898640 -1.789240
H  1.470903 -1.052643  0.038047  0.575211  2.135044
I  0.781189  0.746870  1.095627 -1.719497 -0.689932
J -0.541974  2.608786 -0.149848  0.647683  1.762130

In [27]:
dataframe.columns

Index(['Score1', 'Score2', 'Score3', 'Score4', 'Score5'], dtype='object')

In [28]:
dataframe[['Score1', 'Score2', 'Score5', 'Score3', 'Score4']]

     Score1    Score2    Score5    Score3    Score4
A  0.851100 -1.083754 -0.841003  1.136511  0.797334
B -1.770584  0.695662  0.177477 -0.479670 -0.836000
C -0.208711 -1.037963 -0.295302  0.197806 -0.859532
D -1.123644  0.827014 -0.629303 -0.670611 -0.966687
E -0.329187  0.462367 -0.598591  0.072301  0.217168
F -0.594047 -1.112598  0.419095 -0.013298 -0.049444
G  1.216281 -1.498905 -1.789240  0.416352  0.898640
H  1.470903 -1.052643  2.135044  0.038047  0.575211
I  0.781189  0.746870 -0.689932  1.095627 -1.719497
J -0.541974  2.608786  1.762130 -0.149848  0.647683

In [29]:
# Selecting Rows

dataframe.loc['A']

Score1    0.851100
Score2   -1.083754
Score3    1.136511
Score4    0.797334
Score5   -0.841003
Name: A, dtype: float64

In [30]:
dataframe.iloc[0]

Score1    0.851100
Score2   -1.083754
Score3    1.136511
Score4    0.797334
Score5   -0.841003
Name: A, dtype: float64

In [31]:
dataframe.loc['A', 'Score1']

0.8511001489155461

In [32]:
dataframe.loc[['A','B'], ['Score1', 'Score2']]

     Score1    Score2
A  0.851100 -1.083754
B -1.770584  0.695662

In [33]:
dataframe > 0.5

   Score1  Score2  Score3  Score4  Score5
A    True   False    True    True   False
B   False    True   False   False   False
C   False   False   False   False   False
D   False    True   False   False   False
E   False   False   False   False   False
F   False   False   False   False   False
G    True   False   False    True   False
H    True   False   False    True    True
I    True    True    True   False   False
J   False    True   False    True    True

In [34]:
dataframe[dataframe > 0.5]

     Score1    Score2    Score3    Score4    Score5
A  0.851100       NaN  1.136511  0.797334       NaN
B       NaN  0.695662       NaN       NaN       NaN
C       NaN       NaN       NaN       NaN       NaN
D       NaN  0.827014       NaN       NaN       NaN
E       NaN       NaN       NaN       NaN       NaN
F       NaN       NaN       NaN       NaN       NaN
G  1.216281       NaN       NaN  0.898640       NaN
H  1.470903       NaN       NaN  0.575211  2.135044
I  0.781189  0.746870  1.095627       NaN       NaN
J       NaN  2.608786       NaN  0.647683  1.762130

In [35]:
dataframe['Score1'] > 0.5

A     True
B    False
C    False
D    False
E    False
F    False
G     True
H     True
I     True
J    False
Name: Score1, dtype: bool

In [36]:
dataframe[dataframe['Score1'] > 0.5]

     Score1    Score2    Score3    Score4    Score5
A  0.851100 -1.083754  1.136511  0.797334 -0.841003
G  1.216281 -1.498905  0.416352  0.898640 -1.789240
H  1.470903 -1.052643  0.038047  0.575211  2.135044
I  0.781189  0.746870  1.095627 -1.719497 -0.689932

In [37]:
dataframe[dataframe['Score1'] > 0.5][['Score1', 'Score2']]

     Score1    Score2
A  0.851100 -1.083754
G  1.216281 -1.498905
H  1.470903 -1.052643
I  0.781189  0.746870

In [38]:
dataframe[(dataframe['Score1'] > 0.5) & (dataframe['Score2'] < 0)]

     Score1    Score2    Score3    Score4    Score5
A  0.851100 -1.083754  1.136511  0.797334 -0.841003
G  1.216281 -1.498905  0.416352  0.898640 -1.789240
H  1.470903 -1.052643  0.038047  0.575211  2.135044

In [39]:
dataframe.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype='object')

In [40]:
dataframe.reset_index()

  index    Score1    Score2    Score3    Score4    Score5
0     A  0.851100 -1.083754  1.136511  0.797334 -0.841003
1     B -1.770584  0.695662 -0.479670 -0.836000  0.177477
2     C -0.208711 -1.037963  0.197806 -0.859532 -0.295302
3     D -1.123644  0.827014 -0.670611 -0.966687 -0.629303
4     E -0.329187  0.462367  0.072301  0.217168 -0.598591
5     F -0.594047 -1.112598 -0.013298 -0.049444  0.419095
6     G  1.216281 -1.498905  0.416352  0.898640 -1.789240
7     H  1.470903 -1.052643  0.038047  0.575211  2.135044
8     I  0.781189  0.746870  1.095627 -1.719497 -0.689932
9     J -0.541974  2.608786 -0.149848  0.647683  1.762130

In [41]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  0.851100 -1.083754  1.136511  0.797334 -0.841003
B -1.770584  0.695662 -0.479670 -0.836000  0.177477
C -0.208711 -1.037963  0.197806 -0.859532 -0.295302
D -1.123644  0.827014 -0.670611 -0.966687 -0.629303
E -0.329187  0.462367  0.072301  0.217168 -0.598591
F -0.594047 -1.112598 -0.013298 -0.049444  0.419095
G  1.216281 -1.498905  0.416352  0.898640 -1.789240
H  1.470903 -1.052643  0.038047  0.575211  2.135044
I  0.781189  0.746870  1.095627 -1.719497 -0.689932
J -0.541974  2.608786 -0.149848  0.647683  1.762130

In [42]:
# Setting new index value
newindex = 'IND JP CAN GE IT PL FY IU RT IP'.split()

In [43]:
dataframe['Countries'] = newindex

In [44]:
dataframe

     Score1    Score2    Score3    Score4    Score5 Countries
A  0.851100 -1.083754  1.136511  0.797334 -0.841003       IND
B -1.770584  0.695662 -0.479670 -0.836000  0.177477        JP
C -0.208711 -1.037963  0.197806 -0.859532 -0.295302       CAN
D -1.123644  0.827014 -0.670611 -0.966687 -0.629303        GE
E -0.329187  0.462367  0.072301  0.217168 -0.598591        IT
F -0.594047 -1.112598 -0.013298 -0.049444  0.419095        PL
G  1.216281 -1.498905  0.416352  0.898640 -1.789240        FY
H  1.470903 -1.052643  0.038047  0.575211  2.135044        IU
I  0.781189  0.746870  1.095627 -1.719497 -0.689932        RT
J -0.541974  2.608786 -0.149848  0.647683  1.762130        IP

In [45]:
dataframe.set_index('Countries')

             Score1    Score2    Score3    Score4    Score5
Countries
IND        0.851100 -1.083754  1.136511  0.797334 -0.841003
JP        -1.770584  0.695662 -0.479670 -0.836000  0.177477
CAN       -0.208711 -1.037963  0.197806 -0.859532 -0.295302
GE        -1.123644  0.827014 -0.670611 -0.966687 -0.629303
IT        -0.329187  0.462367  0.072301  0.217168 -0.598591
PL        -0.594047 -1.112598 -0.013298 -0.049444  0.419095
FY         1.216281 -1.498905  0.416352  0.898640 -1.789240
IU         1.470903 -1.052643  0.038047  0.575211  2.135044
RT         0.781189  0.746870  1.095627 -1.719497 -0.689932
IP        -0.541974  2.608786 -0.149848  0.647683  1.762130

In [46]:
dataframe

     Score1    Score2    Score3    Score4    Score5 Countries
A  0.851100 -1.083754  1.136511  0.797334 -0.841003       IND
B -1.770584  0.695662 -0.479670 -0.836000  0.177477        JP
C -0.208711 -1.037963  0.197806 -0.859532 -0.295302       CAN
D -1.123644  0.827014 -0.670611 -0.966687 -0.629303        GE
E -0.329187  0.462367  0.072301  0.217168 -0.598591        IT
F -0.594047 -1.112598 -0.013298 -0.049444  0.419095        PL
G  1.216281 -1.498905  0.416352  0.898640 -1.789240        FY
H  1.470903 -1.052643  0.038047  0.575211  2.135044        IU
I  0.781189  0.746870  1.095627 -1.719497 -0.689932        RT
J -0.541974  2.608786 -0.149848  0.647683  1.762130        IP

In [47]:
dataframe.set_index('Countries', inplace=True)

In [48]:
dataframe

             Score1    Score2    Score3    Score4    Score5
Countries
IND        0.851100 -1.083754  1.136511  0.797334 -0.841003
JP        -1.770584  0.695662 -0.479670 -0.836000  0.177477
CAN       -0.208711 -1.037963  0.197806 -0.859532 -0.295302
GE        -1.123644  0.827014 -0.670611 -0.966687 -0.629303
IT        -0.329187  0.462367  0.072301  0.217168 -0.598591
PL        -0.594047 -1.112598 -0.013298 -0.049444  0.419095
FY         1.216281 -1.498905  0.416352  0.898640 -1.789240
IU         1.470903 -1.052643  0.038047  0.575211  2.135044
RT         0.781189  0.746870  1.095627 -1.719497 -0.689932
IP        -0.541974  2.608786 -0.149848  0.647683  1.762130

In [49]:
# Missing Values in Dataframes

dict = {'Cricket':[1,2,np.nan,4,5,6,7,3,5,np.nan],
        'Baseball': [2,3,np.nan,np.nan,3,5,1,7,4,6],
        'Tennis': [1,6,4,8,3,5,7,8,3,2]}

In [50]:
dataframe = pd.DataFrame(dict)

In [51]:
dataframe

   Cricket  Baseball  Tennis
0      1.0       2.0       1
1      2.0       3.0       6
2      NaN       NaN       4
3      4.0       NaN       8
4      5.0       3.0       3
5      6.0       5.0       5
6      7.0       1.0       7
7      3.0       7.0       8
8      5.0       4.0       3
9      NaN       6.0       2

In [52]:
dataframe.dropna()   # By Default, rows with atleast 1 NAN is dropped

   Cricket  Baseball  Tennis
0      1.0       2.0       1
1      2.0       3.0       6
4      5.0       3.0       3
5      6.0       5.0       5
6      7.0       1.0       7
7      3.0       7.0       8
8      5.0       4.0       3

In [53]:
dataframe.dropna(axis=1)

   Tennis
0       1
1       6
2       4
3       8
4       3
5       5
6       7
7       8
8       3
9       2

In [54]:
dataframe

   Cricket  Baseball  Tennis
0      1.0       2.0       1
1      2.0       3.0       6
2      NaN       NaN       4
3      4.0       NaN       8
4      5.0       3.0       3
5      6.0       5.0       5
6      7.0       1.0       7
7      3.0       7.0       8
8      5.0       4.0       3
9      NaN       6.0       2

In [55]:
dataframe.dropna(thresh=2)   # Thresh parameter looks for non NA values

   Cricket  Baseball  Tennis
0      1.0       2.0       1
1      2.0       3.0       6
3      4.0       NaN       8
4      5.0       3.0       3
5      6.0       5.0       5
6      7.0       1.0       7
7      3.0       7.0       8
8      5.0       4.0       3
9      NaN       6.0       2

In [56]:
dataframe

   Cricket  Baseball  Tennis
0      1.0       2.0       1
1      2.0       3.0       6
2      NaN       NaN       4
3      4.0       NaN       8
4      5.0       3.0       3
5      6.0       5.0       5
6      7.0       1.0       7
7      3.0       7.0       8
8      5.0       4.0       3
9      NaN       6.0       2

In [57]:
dataframe.fillna(0)

   Cricket  Baseball  Tennis
0      1.0       2.0       1
1      2.0       3.0       6
2      0.0       0.0       4
3      4.0       0.0       8
4      5.0       3.0       3
5      6.0       5.0       5
6      7.0       1.0       7
7      3.0       7.0       8
8      5.0       4.0       3
9      0.0       6.0       2

In [58]:
dataframe

   Cricket  Baseball  Tennis
0      1.0       2.0       1
1      2.0       3.0       6
2      NaN       NaN       4
3      4.0       NaN       8
4      5.0       3.0       3
5      6.0       5.0       5
6      7.0       1.0       7
7      3.0       7.0       8
8      5.0       4.0       3
9      NaN       6.0       2

In [59]:
dataframe['Baseball'] = dataframe['Baseball'].fillna(dataframe['Baseball'].mean())

In [60]:
dataframe

   Cricket  Baseball  Tennis
0      1.0     2.000       1
1      2.0     3.000       6
2      NaN     3.875       4
3      4.0     3.875       8
4      5.0     3.000       3
5      6.0     5.000       5
6      7.0     1.000       7
7      3.0     7.000       8
8      5.0     4.000       3
9      NaN     6.000       2

In [63]:
dat = {'CustID':['1001','1001','1002','1002','1003','1003'],
       'CustName':['UIPat','DatRob','Goog','Chrysler','Ford','GM'],
       'Profitinlakhs':[2005,3245,1245,8765,5463,3547]}

In [64]:
dataframe = pd.DataFrame(dat)

In [66]:
dataframe

  CustID  CustName  Profitinlakhs
0   1001     UIPat           2005
1   1001    DatRob           3245
2   1002      Goog           1245
3   1002  Chrysler           8765
4   1003      Ford           5463
5   1003        GM           3547

In [67]:
custID_grouped = dataframe.groupby('CustID')

In [68]:
custID_grouped.mean()

        Profitinlakhs
CustID
1001             2625
1002             5005
1003             4505

In [69]:
dataframe.describe()

       Profitinlakhs
count       6.000000
mean     4045.000000
std      2726.856359
min      1245.000000
25%      2315.000000
50%      3396.000000
75%      4984.000000
max      8765.000000

In [70]:
custID_grouped.describe().T[['1001','1002']]

CustID                      1001         1002
Profitinlakhs count     2.000000     2.000000
              mean   2625.000000  5005.000000
              std     876.812409  5317.442995
              min    2005.000000  1245.000000
              25%    2315.000000  3125.000000
              50%    2625.000000  5005.000000
              75%    2935.000000  6885.000000
              max    3245.000000  8765.000000

In [71]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CustID         6 non-null      object
 1   CustName       6 non-null      object
 2   Profitinlakhs  6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [72]:
dataframe['CustID'].describe()

count        6
unique       3
top       1002
freq         2
Name: CustID, dtype: object

In [74]:
# Merge

Table1 = pd.DataFrame({'CustID': ['1001', '1002', '1003', '1004'],
                     'Q1': ['101', '102', '103', '104'],
                     'Q2': ['201', '202', '203', '204']})
   
Table2 = pd.DataFrame({'CustID': ['1001', '1006', '1003', '1004'],
                          'Q3': ['301', '302', '303', '304'],
                          'Q4': ['401', '402', '403', '404']})

In [76]:
Table1

  CustID   Q1   Q2
0   1001  101  201
1   1002  102  202
2   1003  103  203
3   1004  104  204

In [77]:
Table2

  CustID   Q3   Q4
0   1001  301  401
1   1006  302  402
2   1003  303  403
3   1004  304  404

In [78]:
pd.merge(Table1,Table2,how='outer',on='CustID')

  CustID   Q1   Q2   Q3   Q4
0   1001  101  201  301  401
1   1002  102  202  NaN  NaN
2   1003  103  203  303  403
3   1004  104  204  304  404
4   1006  NaN  NaN  302  402

In [80]:
Table1 = pd.DataFrame({'Q1': ['101', '102', '103'],
                     'Q2': ['201', '202', '203']},
                      index=['I0', 'I1', 'I2']) 

Table2 = pd.DataFrame({'Q3': ['301', '302', '303'],
                    'Q4': ['401', '402', '403']},
                      index=['I0', 'I2', 'I3'])

In [82]:
Table1

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

In [83]:
Table2

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

In [84]:
Table1.join(Table2,how='right')

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I2  103  203  302  402
I3  NaN  NaN  303  403

In [85]:
dataframe = pd.DataFrame({'custID':[1,2,3,4],'SaleType':['big','small','medium','big'],'SalesCode':['121','131','141','151']})
dataframe

   custID SaleType SalesCode
0       1      big       121
1       2    small       131
2       3   medium       141
3       4      big       151

In [86]:
dataframe['SaleType'].unique()

array(['big', 'small', 'medium'], dtype=object)

In [87]:
dataframe['SaleType'].nunique()

3

In [88]:
dataframe['SaleType'].value_counts()

big       2
small     1
medium    1
Name: SaleType, dtype: int64

In [89]:
dataframe['SalesAmt'] = [100,200,300,400]

In [90]:
dataframe

   custID SaleType SalesCode  SalesAmt
0       1      big       121       100
1       2    small       131       200
2       3   medium       141       300
3       4      big       151       400

In [91]:
def salesbeforetax(a):
  return a*.82

In [92]:
salesbeforetax(100)

82.0

In [93]:
dataframe['SalesAmt'].apply(salesbeforetax)

0     82.0
1    164.0
2    246.0
3    328.0
Name: SalesAmt, dtype: float64

In [94]:
dataframe['SalesAmt'] = dataframe['SalesAmt'].apply(salesbeforetax)

In [95]:
dataframe

   custID SaleType SalesCode  SalesAmt
0       1      big       121      82.0
1       2    small       131     164.0
2       3   medium       141     246.0
3       4      big       151     328.0

In [96]:
dataframe['SaleType'].apply(len)

0    3
1    5
2    6
3    3
Name: SaleType, dtype: int64

In [97]:
del dataframe['custID']

In [98]:
dataframe

  SaleType SalesCode  SalesAmt
0      big       121      82.0
1    small       131     164.0
2   medium       141     246.0
3      big       151     328.0

In [99]:
dataframe.sort_values(by='SaleType')

  SaleType SalesCode  SalesAmt
0      big       121      82.0
3      big       151     328.0
2   medium       141     246.0
1    small       131     164.0

In [103]:
#Data import and export
dataframe1 = pd.read_csv('pandas-train.csv')

In [104]:
dataframe2 = pd.read_excel('pandas-Consumer.xlsx')

In [105]:
dataframe1.to_csv('train_exported.csv', index=False)

In [106]:
dataframe2.to_excel('train2_exported.xlsx', sheet_name='Data2')

In [107]:
dataframe1.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [108]:
dataframe1.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [116]:
dataframe1['Survived'].sum()

342

In [117]:
dataframe1['Age'].mean()

29.69911764705882

In [119]:
dataframe1.groupby('Sex').Age.mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [129]:
dataframe1[dataframe1['Fare'] == dataframe1['Fare'].max()][['Name', 'Fare']]

                                   Name      Fare
258                    Ward, Miss. Anna  512.3292
679  Cardeza, Mr. Thomas Drake Martinez  512.3292
737              Lesurer, Mr. Gustave J  512.3292

In [133]:
dataframe1.groupby('Embarked')['Fare'].mean()

Embarked
S    32.204208
Name: Fare, dtype: float64

In [141]:
dataframe1[(dataframe1['Survived'] == 1) & (dataframe1['Sex'] == 'male')]['Age'].mean()

27.276021505376345